{
  "_name_or_path": "bert-large-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": 0.2,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-FOOD",
    "2": "I-FOOD",
    "3": "B-QUANTITY",
    "4": "I-QUANTITY",
    "5": "B-UNIT",
    "6": "I-UNIT",
    "7": "B-PROCESS",
    "8": "I-PROCESS",
    "9": "B-PHYSICAL_QUALITY",
    "10": "I-PHYSICAL_QUALITY",
    "11": "B-COLOR",
    "12": "I-COLOR",
    "13": "B-TASTE",
    "14": "I-TASTE",
    "15": "B-PURPOSE",
    "16": "I-PURPOSE",
    "17": "B-PART",
    "18": "I-PART",
    "19": "B-TRADE_NAME",
    "20": "I-TRADE_NAME",
    "21": "B-DIET",
    "22": "I-DIET",
    "23": "B-EXAMPLE",
    "24": "I-EXAMPLE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-COLOR": 11,
    "B-DIET": 21,
    "B-EXAMPLE": 23,
    "B-FOOD": 1,
    "B-PART": 17,
    "B-PHYSICAL_QUALITY": 9,
    "B-PROCESS": 7,
    "B-PURPOSE": 15,
    "B-QUANTITY": 3,
    "B-TASTE": 13,
    "B-TRADE_NAME": 19,
    "B-UNIT": 5,
    "I-COLOR": 12,
    "I-DIET": 22,
    "I-EXAMPLE": 24,
    "I-FOOD": 2,
    "I-PART": 18,
    "I-PHYSICAL_QUALITY": 10,
    "I-PROCESS": 8,
    "I-PURPOSE": 16,
    "I-QUANTITY": 4,
    "I-TASTE": 14,
    "I-TRADE_NAME": 20,
    "I-UNIT": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_pretrained_path": ".",
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "num_of_tokens": 128,
  "only_first_token": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "training_args": {
    "learning_rate": 2e-05,
    "num_train_epochs": 30,
    "output_dir": "./bert-checkpoints",
    "per_device_eval_batch_size": 32,
    "per_device_train_batch_size": 16,
    "seed": 42,
    "weight_decay": 0.01
  },
  "transformers_version": "4.18.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "use_crf": false,
  "vocab_size": 28997
}
